---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoofFailures.UserCancelledRoof
source: html/598c487f-914e-c98a-5466-312058ab4f23.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoofFailures.UserCancelledRoof Property

Cancelled.

## Syntax (C#)
```csharp
public static FailureDefinitionId UserCancelledRoof { get; }
```